{
  "profession": "Software-Ingenieur & Front-End-Entwickler",
  "emailMe": "E-Mail an mich",
  "aboutMe": "Ich bin ein leidenschaftlicher Software-Ingenieur und Front-End-Entwickler (React JS) mit Fachkenntnissen in agilen Frameworks, Scrum und Softwareentwicklung. Ich habe wertvolle Erfahrungen in Next.js, spezialisiert auf die Erstellung von leistungsstarken Webanwendungen, die Optimierung der Seitenwiedergabe und die Implementierung fortschrittlicher Funktionen. Ich liebe es, Innovationen voranzutreiben, außergewöhnliche Benutzererfahrungen zu liefern und mit dynamischen Teams zusammenzuarbeiten, um Erwartungen zu übertreffen und Erfolg im sich ständig weiterentwickelnden Bereich der Softwareentwicklung zu erzielen.",
  "Experience": "Erfahrung",
  "digitalEdgePosition": "Front-End-Entwickler & WordPress-Entwickler",
  "October": "Oktober",
  "digitalEdgeDescription": "Während meiner Zeit bei DigitalEdge Company als Front-End-Entwickler und WordPress-Spezialist spielte ich eine entscheidende Rolle bei der Bereitstellung außergewöhnlicher Website-Designs. Durch die Nutzung meiner Fähigkeiten in der Front-End-Entwicklung und WordPress-Anpassung habe ich visuell ansprechende und benutzerfreundliche Websites erstellt, die die Markenidentität des Unternehmens widerspiegelten. Durch responsive Designtechniken und benutzerdefinierte React JS-Bibliotheken habe ich Websites für nahtlose Leistung auf mehreren Geräten optimiert. Meine Beiträge zur Integration von nutzergenerierten Inhalten verbesserten das Benutzerengagement und förderten eine lebendige Online-Community.",
  "digitalEdgeCertificate": "Qualifizierte Zertifizierung",
  "frontEndDeveloper": "Front-End-Entwickler",
  "March": "März",
  "September": "September",
  "innovuraDescription": "In meiner Rolle bei INNOVURA Company hatte ich die Gelegenheit, benutzerdefinierte Add-Ons und Plugins für Jira zu entwickeln, neben meiner Expertise in der Website-Entwicklung. Dies ermöglichte es mir, meine Fähigkeiten zu erweitern und zum Wachstum des Unternehmens beizutragen, indem ich maßgeschneiderte Lösungen für Jira-Benutzer lieferte. Durch die Nutzung meiner Erfahrung in der Jira-Anpassung habe ich erfolgreich benutzerdefinierte Add-Ons und Plugins entwickelt und bereitgestellt, die die Funktionalität und Effizienz der Plattform verbesserten. Darüber hinaus sammelte ich wertvolle Erfahrungen in Next.js, einem beliebten React-Framework für den Aufbau von serverseitig gerenderten und statischen Websites. Durch meine Beteiligung an Next.js-Projekten habe ich mein Wissen in der Erstellung von leistungsstarken Webanwendungen, der Optimierung der Seitenwiedergabe und der Implementierung fortschrittlicher Funktionen gestärkt. Diese doppelte Kompetenz in Jira-Anpassung, Website-Entwicklung und Next.js ermöglicht es mir, umfassende Lösungen zu bieten, um die vielfältigen Bedürfnisse der Kunden zu erfüllen und dabei die neuesten Technologien und Best Practices zu nutzen.",
  "innovuraCertificate": "Beschäftigungsnachweis",
  "wordPressDeveloper": "WordPress-Entwickler",
  "November": "November",
  "December": "Dezember",
  "UCTDescription": "In meiner Rolle bei UCT konzentrierte ich mich hauptsächlich auf die WordPress-Entwicklung, insbesondere auf das Design und die Wartung von Websites. Ich nutzte meine Expertise in der Website-Entwicklung, um visuell ansprechende und funktionale WordPress-Websites für Kunden zu erstellen. Durch die Nutzung meiner Fähigkeiten in der WordPress-Anpassung und -Optimierung stellte ich sicher, dass die von mir entwickelten Websites auf die spezifischen Bedürfnisse jedes Kunden zugeschnitten waren. Darüber hinaus bot ich laufende Wartung und Unterstützung, um sicherzustellen, dass die Websites aktuell, sicher und optimal funktionierten. Durch meine Kompetenz in der WordPress-Entwicklung und Website-Wartung trug ich zum Erfolg von UCT bei, indem ich zuverlässige und benutzerfreundliche Websites lieferte, die den Erwartungen unserer Kunden entsprachen.",
  "Education": "Bildung",
  "IT-Software Engineering": "IT - Software-Engineering",
  "University": "Universität",
  "BachelorDegree": "Bachelor-Abschluss",
  "BachelorsDegreeDescription": "An der Al-Baath-Universität verfolgte ich einen Bachelor-Abschluss in IT - Software-Engineering. Während meiner akademischen Laufbahn hatte ich die Gelegenheit, eine Vielzahl von Kursen zu absolvieren, die mir eine solide Grundlage in verschiedenen Aspekten des Software-Engineerings vermittelten. Einer der Schwerpunkte war Datenstrukturen und Algorithmen (DSA), wo ich ein tiefes Verständnis für grundlegende Datenstrukturen wie Arrays, verkettete Listen, Stacks, Queues, Bäume und Graphen erlangte. Ich lernte auch verschiedene Algorithmen und Techniken zur effizienten Problemlösung kennen, wie Sortier-, Such- und Graphendurchlaufalgorithmen. Neben DSA tauchte ich in die Welt der objektorientierten Programmierung (OOP) ein, die mir ein solides Verständnis der Prinzipien und Konzepte hinter dem Aufbau modularer und wiederverwendbarer Softwarekomponenten vermittelte. Durch praktische Projekte und Aufgaben verfeinerte ich meine Fähigkeiten im Entwerfen von Klassen, Kapselung, Vererbung und Polymorphismus, was es mir ermöglichte, robuste und wartbare Softwarelösungen zu entwickeln. Ein weiterer bedeutender Aspekt meines Studiums war die Erforschung von Software-Designmustern. Ich lernte verschiedene Designmuster wie Singleton, Factory, Observer und MVC (Model-View-Controller) kennen, die mir wertvolle Einblicke in die Architektur skalierbarer und wartbarer Softwareanwendungen boten. Das Verständnis dieser Designmuster ermöglichte es mir, komplexe Software-Design-Herausforderungen effektiv zu bewältigen. Darüber hinaus umfasste meine Ausbildung an der Al-Baath-Universität andere wichtige Fächer, darunter Datenbankmanagementsysteme, Webentwicklung, Softwaretestmethoden, Betriebssysteme und Computernetzwerke. Diese Kurse erweiterten mein Wissen und meine Fähigkeiten in Bereichen, die für modernes Software-Engineering unerlässlich sind. Während meines Studiums hatte ich die Gelegenheit, an kollaborativen Projekten zu arbeiten, an Programmierwettbewerben teilzunehmen und praktische Aufgaben zu bearbeiten, die mein Verständnis der theoretischen Konzepte weiter festigten. Die Kombination aus theoretischem Wissen und praktischer Erfahrung, die ich aus diesen Kursen gewonnen habe, hat mich darauf vorbereitet, reale Herausforderungen im Software-Engineering mit Zuversicht zu meistern. Insgesamt hat mir meine Ausbildung an der Al-Baath-Universität ein umfassendes Verständnis der Prinzipien des Software-Engineerings vermittelt und mich mit den notwendigen Fähigkeiten ausgestattet, um hochwertige Softwaresysteme zu entwerfen, zu entwickeln und zu warten. Das Wissen und die Erfahrungen, die ich aus meinem Studium gewonnen habe, waren entscheidend für die Gestaltung meiner Karriere als Software-Ingenieur.",
  "Skills": "Fähigkeiten",
  "MajorSkills": "Hauptfähigkeiten",
  "MinorSkills": "Nebenfähigkeiten",
  "ProgrammingLanguages&Tools": "Programmiersprachen & Werkzeuge",
  "Workflow": "Arbeitsablauf",
  "Mobile-First": "Mobile-First, Responsives Design",
  "CrossBrowser": "Cross-Browser-Testing & Debugging",
  "CrossFunctional": "Cross-Funktionale Teams",
  "AgileScrum": "Agile Entwicklung & Scrum",
  "Interests": "Interessen",
  "InterestsDescription": "Als Webentwickler bin ich leidenschaftlich daran interessiert, die neuesten Fortschritte in der Front-End-Webentwicklungstechnologie zu erkunden. Ich widme einen erheblichen Teil meiner Freizeit dem Verfolgen neuer Trends, Frameworks und Bibliotheken.\n\nWas Unterhaltung betrifft, so fühle ich mich besonders zu den Genres Sci-Fi und Fantasy hingezogen, da sie mich oft dazu inspirieren, kreativ zu denken und die Grenzen des Möglichen in der Technologie zu erweitern. Ich genieße es, Sci-Fi- und Fantasy-Filme und -Fernsehsendungen zu sehen, nicht nur zur Unterhaltung, sondern auch, um Inspiration für meine Webentwicklungsprojekte zu finden.\n\nInsgesamt drehen sich meine Interessen um die Schnittstelle von Technologie und Kreativität, sowohl in meiner beruflichen Arbeit als auch in meinen persönlichen Bestrebungen.",
  "ContactMe": "Kontaktieren Sie mich",
  "sendMeMessage": "Fühlen Sie sich frei, mir eine Nachricht zu senden",
  "YourName": "Ihr Name",
  "YourEmail": "Ihre E-Mail",
  "YourMessage": "Ihre Nachricht",
  "Submit": "E-Mail senden"
}